app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("title", "description", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dsf"], ["description", "sdf"], ["location", "sdf"], ["created_at", "2021-12-01 05:04:00.219210"], ["updated_at", "2021-12-01 05:04:00.219210"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save