app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.base64(64)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "hqGTVDGve0v5ba8j6H5v/VbuUcMQyjNthSMiVKZSfVOrQhEq0oTGg6b38/WxNd0uAZk7s3/eqk7jlpuUsO4izg=="], ["updated_at", "2021-11-22 03:09:41.383432"], ["id", 4]]